In [1]:
import pandas as pd

In [ ]:
# more information:

In [29]:
%%html
<iframe src="https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html" width="1200" height="1000"></iframe>

In [2]:
# Define a dictionary containing Students data
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}
  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data)

In [3]:
df

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

In [4]:
# Define a dictionary with key values of
# an existing column and their respective
# value pairs as the # values for our new column.
address = {'Delhi': 'Jai', 'Bangalore': 'Princi',
           'Patna': 'Gaurav', 'Chennai': 'Anuj'}
  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
  
# Provide 'Address' as the column name
df['Address'] = address
  
# Observe the output

In [5]:

df

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc      Patna
3    Anuj     5.2           Msc    Chennai

In [25]:
D2=pd.Series(['Delhi','Bangalore', 'Patna', 'Chennai','Nowhere'], name='foo')

In [26]:
t=pd.concat([df, D2], axis=1)
t

     Name  Height Qualification    Address        foo
0     Jai     5.1           Msc      Delhi      Delhi
1  Princi     6.2            MA  Bangalore  Bangalore
2  Gaurav     5.1           Msc      Patna      Patna
3    Anuj     5.2           Msc    Chennai    Chennai
4     NaN     NaN           NaN        NaN    Nowhere

In [27]:
s4 = pd.Series([0, 1, 2, 3])
s5 = pd.Series([0, 1, 4, 5])
pd.concat([D2, s4, s5], axis=1, keys=["red", "blue", "yellow"])

         red  blue  yellow
0      Delhi   0.0     0.0
1  Bangalore   1.0     1.0
2      Patna   2.0     4.0
3    Chennai   3.0     5.0
4    Nowhere   NaN     NaN

In [ ]:
pd.concat([D2, s4, s5], axis=1, keys=["red", "blue", "yellow"]. join)